package com.socialuni.social.partner.config;

import java.util.HashMap;
import java.util.Map;


public class SocialuniParterConfig {
    public static final Map<String, Integer> monthPointsConfig = new HashMap<>() {{
        put("2024-08", 30);
        put("2024-09", 63);
        put("2024-10", 45);
        put("2024-11", 45);
        put("2024-12", 30);
        put("2025-01", 30);
        put("2025-02", 30);
        put("2025-03", 21);
        put("2025-04", 21);
        put("2025-05", 21);
        put("2025-06", 18);
        put("2025-07", 18);
        put("2025-08", 18);
        put("2025-09", 18);
        put("2025-10", 18);
        put("2025-11", 18);
        put("2025-12", 15);
        put("2026-01", 15);
        put("2027-01", 6);
    }};

//初步计划，8月内测，每天分配30w积分
//2024年，9月，每日分配63w积分
//2024年，10月，每日分配45w积分
//2024年，11月，每日分配45w积分
//2024年，12月，每日分配30w积分
//2025年，1月，每日分配30w积分
//2025年，2月，每日分配30w积分
//2025年，3月，每日分配21w积分
//2025年，4月，每日分配21w积分
//2025年，5月，每日分配21w积分
//2025年，6月，每日分配18w积分
//2025年，7月，每日分配18w积分
//2025年，8月，每日分配18w积分
//2025年，9月，每日分配18w积分
//2025年，10月，每日分配18w积分
//2025年，11月，每日分配18w积分
//2025年，12月，每日分配15w积分
//2026年，1月，每日分配15w积分
//2026年，2月，每日分配15w积分
//2026年，3月，每日分配15w积分
//2026年，4月，每日分配15w积分
//2026年，5月，每日分配15w积分
//2026年，6月，每日分配12w积分
//2026年，7月，每日分配12w积分
//2026年，8月，每日分配12w积分
//2026年，9月，每日分配9w积分
//2026年，10月，每日分配9w积分
//2026年，11月，每日分配6w积分
//2026年，12月，每日分配6w积分
//2027年，1月，每日分配6w积分
//2027年，2月，每日分配6w积分
//2027年，3月，每日分配3w积分
//2027年，4月，每日分配3w积分
//2027年，5月，每日分配3w积分
//2027年，6月，每日分配3w积分
//2027年，7月，每日分配3w积分
//2027年，8月，每日分配3w积分
}
